Revit 2027 API
Reference.CreateLinkReference Method
Creates a Reference from a Reference in an RVT Link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference CreateLinkReference(
	RevitLinkInstance revitLinkInstance
)
Public Function CreateLinkReference (
	revitLinkInstance As RevitLinkInstance
) As Reference
public:
Reference^ CreateLinkReference(
	RevitLinkInstance^ revitLinkInstance
)
member CreateLinkReference :
        revitLinkInstance : RevitLinkInstance -> Reference
Parameters
revitLinkInstance RevitLinkInstance
Id of the RevitLinkInstance that contains the reference.
Return Value
Reference
Exceptions
Exception | Condition
ArgumentNullException | Thrown when revitLinkInstance is null.
Remarks
The reference that is returned can be used to create a family instance on a face in an RVT link.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace